app/controllers/posts_controller.rb

  def create
  	@post = Post.new(post_params)
  	@post.user_id = current_user.id
  	@post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "testing"], ["created_at", "2018-01-01 04:56:46.453174"], ["updated_at", "2018-01-01 04:56:46.453174"], ["user_id", 1]]